:PROPERTIES:
:ID:       b3049366-b5ce-4caa-881f-e76663df2e12
:END:
#+title: Anki: 2021
#+date: "2021-05-01 20:20:25 +08:00"
#+date_modified: "2021-06-18 22:12:31 +08:00"
#+language: en
#+property: anki_deck 2021
#+property: header_args  :exports both

#+name: lilypond-paper-config
#+begin_src lilypond  :exports none  :results none
\paper {
  indent=10\mm
  oddFooterMarkup=##f
}
#+end_src

My collection of tips and tricks I collected in 2021.

** Back
#+begin_src shell
# Format the string.
printf "%s\n" foo bar 'baz ;;'

# Echo the string as-is.
echo "foo
bar
baz ;;"

# Print with escaped newlines.
echo -e "foo\nbar\nbaz ;;"
#+end_src

#+results:
: foo
: bar
: baz ;;
: foo
: bar
: baz ;;
: foo
: bar
: baz ;;

** Back
Every 4 days, starting from the 8th of the month.

Assuming this was executed on 2021-05-12.

#+begin_src shell
systemd-analyze calendar *-*-8/4
#+end_src

#+results:
:   Original form: *-*-8/4
: Normalized form: *-*-08/4 00:00:00
:     Next elapse: Sun 2021-05-16 00:00:00 PST
:        (in UTC): Sat 2021-05-15 16:00:00 UTC
:        From now: 3 days left

** Back
~printf~ throws an error if the given argument is not appropriate.

#+begin_src shell
# This is fine
printf "%d\n" 532 429 40 102

# This will return a non-zero exit code
printf "%d\n" this_will_throw_an_error 430 that_previous_number_will_not

# This is also fine
printf "%f\n" 10 43.45 3.14
#+end_src

#+results:
#+begin_example
532
429
40
102
0
430
0
10.000000
43.450000
3.140000
#+end_example

